Repository: maiconcardozo/CleanTemplateRepository
Catalog: Src/Authentication.API/Resource/ResourceAPI.*.resx
Languages: pt_br

source: Account created successfully.
pt_br: Conta criada com sucesso.

# AnUnexpectedErrorOccurredAccountCouldInserted
source: An unexpected error occurred and the account could not be inserted.
pt_br: Ocorreu um erro inesperado e a conta não pôde ser inserida.

# AnUnexpectedErrorOccurredTokenCouldGenerated
source: An unexpected error occurred and the token could not be generated.
pt_br: Ocorreu um erro inesperado e o token não pôde ser gerado.

# AnUnexpectedErrorOccurredClaimsCouldNotBeRetrieved
source: An unexpected error occurred and the claims could not be retrieved.
pt_br: Ocorreu um erro inesperado e as permissões não puderam ser recuperadas.

source: Claim not found.
pt_br: Permissão não encontrada.

# AnUnexpectedErrorOccurredClaimCouldNotBeRetrieved
source: An unexpected error occurred and the claim could not be retrieved.
pt_br: Ocorreu um erro inesperado e a permissão não pôde ser recuperada.

# AnUnexpectedErrorOccurredClaimCouldNotBeInserted
source: An unexpected error occurred and the claim could not be inserted.
pt_br: Ocorreu um erro inesperado e a permissão não pôde ser inserida.

# AnUnexpectedErrorOccurredClaimCouldNotBeUpdated
source: An unexpected error occurred and the claim could not be updated.
pt_br: Ocorreu um erro inesperado e a permissão não pôde ser atualizada.

source: Claim deleted successfully.
pt_br: Permissão excluída com sucesso.

# AnUnexpectedErrorOccurredClaimCouldNotBeDeleted
source: An unexpected error occurred and the claim could not be deleted.
pt_br: Ocorreu um erro inesperado e a permissão não pôde ser excluída.

# AnUnexpectedErrorOccurredActionsCouldNotBeRetrieved
source: An unexpected error occurred and the actions could not be retrieved.
pt_br: Ocorreu um erro inesperado e as ações não puderam ser recuperadas.

source: Action not found.
pt_br: Ação não encontrada.

# AnUnexpectedErrorOccurredActionCouldNotBeRetrieved
source: An unexpected error occurred and the action could not be retrieved.
pt_br: Ocorreu um erro inesperado e a ação não pôde ser recuperada.

# AnUnexpectedErrorOccurredActionCouldNotBeInserted
source: An unexpected error occurred and the action could not be inserted.
pt_br: Ocorreu um erro inesperado e a ação não pôde ser inserida.

# AnUnexpectedErrorOccurredActionCouldNotBeUpdated
source: An unexpected error occurred and the action could not be updated.
pt_br: Ocorreu um erro inesperado e a ação não pôde ser atualizada.

source: Action deleted successfully.
pt_br: Ação excluída com sucesso.

# AnUnexpectedErrorOccurredActionCouldNotBeDeleted
source: An unexpected error occurred and the action could not be deleted.
pt_br: Ocorreu um erro inesperado e a ação não pôde ser excluída.

# AnUnexpectedErrorOccurredClaimActionsCouldNotBeRetrieved
source: An unexpected error occurred and the claim actions could not be retrieved.
pt_br: Ocorreu um erro inesperado e as ações de permissão não puderam ser recuperadas.

source: Claim action not found.
pt_br: Ação de permissão não encontrada.

# AnUnexpectedErrorOccurredClaimActionCouldNotBeRetrieved
source: An unexpected error occurred and the claim action could not be retrieved.
pt_br: Ocorreu um erro inesperado e a ação de permissão não pôde ser recuperada.

# AnUnexpectedErrorOccurredClaimActionCouldNotBeInserted
source: An unexpected error occurred and the claim action could not be inserted.
pt_br: Ocorreu um erro inesperado e a ação de permissão não pôde ser inserida.

# AnUnexpectedErrorOccurredClaimActionCouldNotBeUpdated
source: An unexpected error occurred and the claim action could not be updated.
pt_br: Ocorreu um erro inesperado e a ação de permissão não pôde ser atualizada.

source: Claim action deleted successfully.
pt_br: Ação de permissão excluída com sucesso.

# AnUnexpectedErrorOccurredClaimActionCouldNotBeDeleted
source: An unexpected error occurred and the claim action could not be deleted.
pt_br: Ocorreu um erro inesperado e a ação de permissão não pôde ser excluída.

# AnUnexpectedErrorOccurredAccountClaimActionsCouldNotBeRetrieved
source: An unexpected error occurred and the account claim actions could not be retrieved.
pt_br: Ocorreu um erro inesperado e as ações de permissão da conta não puderam ser recuperadas.

source: Account claim action not found.
pt_br: Ação de permissão da conta não encontrada.

# AnUnexpectedErrorOccurredAccountClaimActionCouldNotBeRetrieved
source: An unexpected error occurred and the account claim action could not be retrieved.
pt_br: Ocorreu um erro inesperado e a ação de permissão da conta não pôde ser recuperada.

# AnUnexpectedErrorOccurredAccountClaimActionCouldNotBeInserted
source: An unexpected error occurred and the account claim action could not be inserted.
pt_br: Ocorreu um erro inesperado e a ação de permissão da conta não pôde ser inserida.

# AnUnexpectedErrorOccurredAccountClaimActionCouldNotBeUpdated
source: An unexpected error occurred and the account claim action could not be updated.
pt_br: Ocorreu um erro inesperado e a ação de permissão da conta não pôde ser atualizada.

source: Account claim action deleted successfully.
pt_br: Ação de permissão da conta excluída com sucesso.

# AnUnexpectedErrorOccurredAccountClaimActionCouldNotBeDeleted
source: An unexpected error occurred and the account claim action could not be deleted.
pt_br: Ocorreu um erro inesperado e a ação de permissão da conta não pôde ser excluída.

source: An unhandled exception occurred.
pt_br: Ocorreu uma exceção não tratada.

# DocumentationGenerateToken
source: Performs the user authentication process using the provided credentials.
pt_br: Executa o processo de autenticação do usuário utilizando as credenciais fornecidas.

# GeneratesJWTToken
source: Generates a JWT token
pt_br: Gera um token JWT

# InvalidDataValidationError
source: Invalid data or validation error.
pt_br: Dados inválidos ou erro de validação.

source: Token generated successfully.
pt_br: Token gerado com sucesso.

source: User not authorized.
pt_br: Usuário não autorizado.

# DocumentationAddAccount
source: Performs the account creation process using the provided user information.
pt_br: Executa o processo de criação de conta utilizando as informações de usuário fornecidas.

# AddAccount
source: Add a new account.
pt_br: Adicionar nova conta.

# APIManagement
source: API for user authentication and account management.
pt_br: API para autenticação de usuário e gerenciamento de contas.

# GetActions
source: Get all actions
pt_br: Obter todas as ações

# DocumentationGetActions
source: Retrieves all available actions in the system.
pt_br: Recupera todas as ações disponíveis no sistema.

source: Actions retrieved successfully.
pt_br: Ações recuperadas com sucesso.

source: Get action by ID
pt_br: Obter ação por ID

# DocumentationGetActionById
source: Retrieves a specific action by its unique identifier.
pt_br: Recupera uma ação específica pelo seu identificador único.

source: Action retrieved successfully.
pt_br: Ação recuperada com sucesso.

# AddAction
source: Add new action
pt_br: Adicionar nova ação

# DocumentationAddAction
source: Creates a new action with the provided information.
pt_br: Cria uma nova ação com as informações fornecidas.

source: Action created successfully.
pt_br: Ação criada com sucesso.

source: Update action
pt_br: Atualizar ação

# DocumentationUpdateAction
source: Updates an existing action with the provided information.
pt_br: Atualiza uma ação existente com as informações fornecidas.

source: Action updated successfully.
pt_br: Ação atualizada com sucesso.

source: Delete action
pt_br: Excluir ação

# DocumentationDeleteAction
source: Removes an action from the system by its unique identifier.
pt_br: Remove uma ação do sistema pelo seu identificador único.

# GetClaims
source: Get all claims
pt_br: Obter todas as permissões

# DocumentationGetClaims
source: Retrieves all available claims in the system.
pt_br: Recupera todas as permissões disponíveis no sistema.

source: Claims retrieved successfully.
pt_br: Permissões recuperadas com sucesso.

source: Get claim by ID
pt_br: Obter permissão por ID

# DocumentationGetClaimById
source: Retrieves a specific claim by its unique identifier.
pt_br: Recupera uma permissão específica pelo seu identificador único.

source: Claim retrieved successfully.
pt_br: Permissão recuperada com sucesso.

# AddClaim
source: Add new claim
pt_br: Adicionar nova permissão

# DocumentationAddClaim
source: Creates a new claim with the provided information.
pt_br: Cria uma nova permissão com as informações fornecidas.

source: Claim created successfully.
pt_br: Permissão criada com sucesso.

source: Update claim
pt_br: Atualizar permissão

# DocumentationUpdateClaim
source: Updates an existing claim with the provided information.
pt_br: Atualiza uma permissão existente com as informações fornecidas.

source: Claim updated successfully.
pt_br: Permissão atualizada com sucesso.

source: Delete claim
pt_br: Excluir permissão

# DocumentationDeleteClaim
source: Removes a claim from the system by its unique identifier.
pt_br: Remove uma permissão do sistema pelo seu identificador único.

# GetClaimActions
source: Get all claim actions
pt_br: Obter todas as ações de permissão

# DocumentationGetClaimActions
source: Retrieves all available claim actions in the system.
pt_br: Recupera todas as ações de permissão disponíveis no sistema.

source: Claim actions retrieved successfully.
pt_br: Ações de permissão recuperadas com sucesso.

source: Get claim action by ID
pt_br: Obter ação de permissão por ID

# DocumentationGetClaimActionById
source: Retrieves a specific claim action by its unique identifier.
pt_br: Recupera uma ação de permissão específica pelo seu identificador único.

source: Claim action retrieved successfully.
pt_br: Ação de permissão recuperada com sucesso.

# AddClaimAction
source: Add new claim action
pt_br: Adicionar nova ação de permissão

# DocumentationAddClaimAction
source: Creates a new claim action with the provided information.
pt_br: Cria uma nova ação de permissão com as informações fornecidas.

source: Claim action created successfully.
pt_br: Ação de permissão criada com sucesso.

source: Update claim action
pt_br: Atualizar ação de permissão

# DocumentationUpdateClaimAction
source: Updates an existing claim action with the provided information.
pt_br: Atualiza uma ação de permissão existente com as informações fornecidas.

source: Claim action updated successfully.
pt_br: Ação de permissão atualizada com sucesso.

source: Delete claim action
pt_br: Excluir ação de permissão

# DocumentationDeleteClaimAction
source: Removes a claim action from the system by its unique identifier.
pt_br: Remove uma ação de permissão do sistema pelo seu identificador único.

source: Get account claim actions
pt_br: Obter ações de permissão da conta

# DocumentationGetAccountClaimActions
source: Retrieves account claim actions, optionally filtered by account ID or claim action ID.
pt_br: Recupera ações de permissão da conta, opcionalmente filtradas por ID da conta ou ID da ação de permissão.

source: Account claim actions retrieved successfully.
pt_br: Ações de permissão da conta recuperadas com sucesso.

# GetAccountClaimActionById
source: Get account claim action by IDs
pt_br: Obter ação de permissão da conta por IDs

# DocumentationGetAccountClaimActionById
source: Retrieves a specific account claim action by account ID and claim action ID.
pt_br: Recupera uma ação de permissão específica da conta pelo ID da conta e ID da ação de permissão.

source: Account claim action retrieved successfully.
pt_br: Ação de permissão da conta recuperada com sucesso.

# AddAccountClaimAction
source: Add new account claim action
pt_br: Adicionar nova ação de permissão da conta

# DocumentationAddAccountClaimAction
source: Creates a new account claim action association with the provided information.
pt_br: Cria uma nova associação de ação de permissão da conta com as informações fornecidas.

source: Account claim action created successfully.
pt_br: Ação de permissão da conta criada com sucesso.

source: Update account claim action
pt_br: Atualizar ação de permissão da conta

# DocumentationUpdateAccountClaimAction
source: Updates an existing account claim action association with the provided information.
pt_br: Atualiza uma associação existente de ação de permissão da conta com as informações fornecidas.

source: Account claim action updated successfully.
pt_br: Ação de permissão da conta atualizada com sucesso.

source: Delete account claim action
pt_br: Excluir ação de permissão da conta

# DocumentationDeleteAccountClaimAction
source: Removes an account claim action association from the system.
pt_br: Remove uma associação de ação de permissão da conta do sistema.

source: Request was successful.
pt_br: Solicitação foi bem-sucedida.

source: Invalid request.
pt_br: Solicitação inválida.

source: Unauthorized.
pt_br: Não autorizado.

source: Not found.
pt_br: Não encontrado.

source: Internal server error.
pt_br: Erro interno do servidor.

source: One or more validation errors occurred.
pt_br: Ocorreram um ou mais erros de validação.

source: Authentication failed - Invalid credentials.
pt_br: Falha na autenticação - Credenciais inválidas.

source: An unexpected error occurred.
pt_br: Ocorreu um erro inesperado.

source: The requested resource was not found.
pt_br: O recurso solicitado não foi encontrado.

source: Success
pt_br: Sucesso

# ActionControllerDescription
source: Controller responsible for managing actions in the system. Provides CRUD operations for actions that can be combined with claims to form permissions. Actions define what operations can be performed on resources in the RBAC system.
pt_br: Controller responsável por gerenciar ações no sistema. Fornece operações CRUD para ações que podem ser combinadas com permissões para formar autorizações. As ações definem quais operações podem ser executadas em recursos no sistema RBAC.

# AccountControllerDescription
source: Controller responsible for managing user accounts in the system. Provides CRUD operations for user accounts, including account creation, retrieval, updates, and deletion. Handles account management operations with proper authentication and authorization controls.
pt_br: Controller responsável por gerenciar contas de usuário no sistema. Fornece operações CRUD para contas de usuário, incluindo criação, recuperação, atualizações e exclusão de contas. Gerencia operações de conta com controles adequados de autenticação e autorização.

# AccountClaimActionControllerDescription
source: Controller responsible for managing account-claim-action associations in the RBAC system. Provides CRUD operations for linking user accounts with specific claim-action permissions. Enables fine-grained access control by assigning specific permissions to individual accounts.
pt_br: Controller responsável por gerenciar associações conta-permissão-ação no sistema RBAC. Fornece operações CRUD para vincular contas de usuário com permissões específicas de permissão-ação. Permite controle de acesso refinado ao atribuir permissões específicas a contas individuais.

# ClaimActionControllerDescription
source: Controller responsible for managing claim-action associations in the RBAC system. Provides CRUD operations for linking claims with actions to create specific permissions. Claim-actions define what operations (actions) can be performed on specific resources (claims).
pt_br: Controller responsável por gerenciar associações permissão-ação no sistema RBAC. Fornece operações CRUD para vincular permissões com ações para criar autorizações específicas. Permissão-ações definem quais operações (ações) podem ser executadas em recursos específicos (permissões).

# ClaimControllerDescription
source: Controller for managing claims in the Role-Based Access Control (RBAC) system. Provides CRUD operations for claims (permissions/roles) that can be assigned to users. Claims are fundamental building blocks for the authorization system.
pt_br: Controller para gerenciar permissões no sistema de controle de acesso baseado em funções (RBAC). Fornece operações CRUD para permissões (papéis/funções) que podem ser atribuídas aos usuários. As permissões são blocos fundamentais do sistema de autorização.

# AuthenticationControllerDescription
source: Controller responsible for handling authentication operations. Provides endpoints for JWT token generation and user authentication.
pt_br: Controller responsável por operações de autenticação. Fornece endpoints para geração de tokens JWT e autenticação de usuários.

source: Accounts retrieved successfully.
pt_br: Contas recuperadas com sucesso.

source: Account updated successfully.
pt_br: Conta atualizada com sucesso.

source: Account deleted successfully.
pt_br: Conta excluída com sucesso.

# AnUnexpectedErrorOccurredAccountCouldNotBeRetrieved
source: An unexpected error occurred and the account could not be retrieved.
pt_br: Ocorreu um erro inesperado e a conta não pôde ser recuperada.

# AnUnexpectedErrorOccurredAccountsCouldNotBeRetrieved
source: An unexpected error occurred and the accounts could not be retrieved.
pt_br: Ocorreu um erro inesperado e as contas não puderam ser recuperadas.

# AnUnexpectedErrorOccurredAccountCouldNotBeUpdated
source: An unexpected error occurred and the account could not be updated.
pt_br: Ocorreu um erro inesperado e a conta não pôde ser atualizada.

# AnUnexpectedErrorOccurredAccountCouldNotBeDeleted
source: An unexpected error occurred and the account could not be deleted.
pt_br: Ocorreu um erro inesperado e a conta não pôde ser excluída.

source: Conflict.
pt_br: Conflito.

# RequestConflictsWithCurrentState
source: The request conflicts with the current state of the resource.
pt_br: A solicitação conflita com o estado atual do recurso.

source: Account not found.
pt_br: Conta não encontrada.

source: Account retrieved successfully.
pt_br: Conta recuperada com sucesso.

source: Delete account
pt_br: Excluir conta

# DocumentationDeleteAccount
source: Removes a user account from the system by its unique identifier.
pt_br: Remove uma conta de usuário do sistema pelo seu identificador único.

# DocumentationGetAccountById
source: Retrieves a specific user account by its unique identifier.
pt_br: Recupera uma conta de usuário específica pelo seu identificador único.

# DocumentationGetAccounts
source: Retrieves all user accounts in the system.
pt_br: Recupera todas as contas de usuário no sistema.

# DocumentationUpdateAccount
source: Updates an existing user account with the provided information.
pt_br: Atualiza uma conta de usuário existente com as informações fornecidas.

source: Get account by ID
pt_br: Obter conta por ID

# GetAccounts
source: Get all accounts
pt_br: Obter todas as contas

source: Update account
pt_br: Atualizar conta

# AuthenticationApiTitle
source: Authentication API
pt_br: API de Autenticação

# ReturnsListOfAllUserAccountsInTheSystem
source: List of all user accounts in the system
pt_br: Lista de todas as contas de usuário no sistema

# ReturnsAccountMatchingTheSpecifiedID
source: Account matching the specified ID
pt_br: Conta correspondente ao ID especificado

# ReturnsCreatedAccountInformation
source: Created account information
pt_br: Informações da conta criada

# ReturnsUpdatedAccountInformation
source: Updated account information
pt_br: Informações da conta atualizada

# ReturnsDeletedAccountDetails
source: Deleted account details
pt_br: Detalhes da conta excluída

# ReturnsListOfAllActionsInTheSystem
source: List of all actions in the system
pt_br: Lista de todas as ações no sistema

# ReturnsActionMatchingTheSpecifiedID
source: Action matching the specified ID
pt_br: Ação correspondente ao ID especificado

# ReturnsCreatedActionInformation
source: Created action information
pt_br: Informações da ação criada

# ReturnsUpdatedActionInformation
source: Updated action information
pt_br: Informações da ação atualizada

# ReturnsDeletedActionDetails
source: Deleted action details
pt_br: Detalhes da ação excluída

# ReturnsListOfAllClaimActionsInTheSystem
source: List of all claim actions in the system
pt_br: Lista de todas as ações de permissão no sistema

# ReturnsClaimActionMatchingTheSpecifiedID
source: Claim action matching the specified ID
pt_br: Ação de permissão correspondente ao ID especificado

# ReturnsCreatedClaimActionInformation
source: Created claim action information
pt_br: Informações da ação de permissão criada

# ReturnsUpdatedClaimActionInformation
source: Updated claim action information
pt_br: Informações da ação de permissão atualizada

# ReturnsDeletedClaimActionDetails
source: Deleted claim action details
pt_br: Detalhes da ação de permissão excluída

# ReturnsClaimMatchingTheSpecifiedID
source: Claim matching the specified ID
pt_br: Permissão correspondente ao ID especificado

# ReturnsCreatedClaimInformation
source: Created claim information
pt_br: Informações da permissão criada

# ReturnsUpdatedClaimInformation
source: Updated claim information
pt_br: Informações da permissão atualizada

# ReturnsDeletedClaimDetails
source: Deleted claim details
pt_br: Detalhes da permissão excluída

# ReturnsListOfAccountClaimActionsMatchingTheSpecifiedFilters
source: List of account claim actions matching the specified filters
pt_br: Lista de ações de permissão da conta correspondentes aos filtros especificados

# ReturnsAccountClaimActionMatchingTheSpecifiedAccountAndClaimActionIDs
source: Account claim action matching the specified account and claim action IDs
pt_br: Ação de permissão da conta correspondente aos IDs da conta e da ação de permissão especificados

# ReturnsCreatedAccountClaimAction
source: Created account claim action
pt_br: Ação de permissão da conta criada

# ReturnsUpdatedAccountClaimAction
source: Updated account claim action
pt_br: Ação de permissão da conta atualizada

# ReturnsDeletedAccountClaimActionDetails
source: Deleted account claim action details
pt_br: Detalhes da ação de permissão da conta excluída

source: Returns a JWT token with user information on success (200), validation errors (400), unauthorized access (401), or internal server error (500)
pt_br: Retorna um token JWT com informações do usuário em caso de sucesso (200), erros de validação (400), acesso não autorizado (401) ou erro interno do servidor (500)

source: List of claim objects with their types, values, and descriptions on success (200), validation errors (400), unauthorized access (401), or internal server error (500)
pt_br: Lista de objetos de permissão com seus tipos, valores e descrições em caso de sucesso (200), erros de validação (400), acesso não autorizado (401) ou erro interno do servidor (500)

# ResponseInvalidRequestParameters
source: Invalid request parameters
pt_br: Parâmetros de solicitação inválidos

# ResponseInvalidRequestData
source: Invalid request data
pt_br: Dados de solicitação inválidos

# ResponseInvalidRequestDataOrValidationErrors
source: Invalid request data or validation errors
pt_br: Dados de solicitação inválidos ou erros de validação

# ResponseUnauthorizedAccess
source: Unauthorized access
pt_br: Acesso não autorizado

# ResponseUnauthorizedAccessValidJWTTokenRequired
source: Unauthorized access - valid JWT token required
pt_br: Acesso não autorizado - token JWT válido obrigatório

# ResponseInvalidCredentials
source: Invalid credentials
pt_br: Credenciais inválidas

# ResponseInternalServerError
source: Internal server error
pt_br: Erro interno do servidor

# ResponseAccountUsernameAlreadyExists
source: Account username already exists
pt_br: Nome de usuário da conta já existe
